# RULE BASED CUSTOMER SEGMENTATION

- **PRICE :**customer paid amount
- **SOURCE :** customer device type
- **SEX :** customer gender
- **COUNTRY :** customer country
- **AGE :** customer age

In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

In [2]:
df = pd.read_csv('persona.csv')
df.head()

   PRICE   SOURCE   SEX COUNTRY  AGE
0     39  android  male     bra   17
1     39  android  male     bra   17
2     49  android  male     bra   17
3     29  android  male     tur   17
4     49  android  male     tur   17

In [3]:
df.describe().T

        count     mean        std   min   25%   50%   75%   max
PRICE  5000.0  34.1320  12.464897   9.0  29.0  39.0  39.0  59.0
AGE    5000.0  23.5814   8.995908  15.0  17.0  21.0  27.0  66.0

In [4]:
df.AGE.unique()

array([17, 26, 23, 15, 19, 21, 16, 35, 42, 40, 49, 34, 18, 32, 25, 30, 20,
       22, 50, 37, 24, 31, 28, 66, 27, 47, 57, 52, 39, 59, 46, 36, 29, 51,
       55, 53, 33, 43, 38, 56, 54, 41, 44, 45, 65, 61], dtype=int64)

In [5]:
def check_df(dataframe, head=5):


    print("##################### Shape #####################")
    print(dataframe.shape)

    print("##################### Types #####################")
    print(dataframe.dtypes)

    print("##################### Head #####################")
    print(dataframe.head(head))

    print("##################### Tail #####################")
    print(dataframe.tail(head))

    print("##################### NA #####################")
    print(dataframe.isnull().sum())

    print("##################### Quantiles #####################")
    print(dataframe.quantile([0, 0.05, 0.50, 0.95, 0.99, 1]).T)

In [6]:
check_df(df)

##################### Shape #####################
(5000, 5)
##################### Types #####################
PRICE       int64
SOURCE     object
SEX        object
COUNTRY    object
AGE         int64
dtype: object
##################### Head #####################
   PRICE   SOURCE   SEX COUNTRY  AGE
0     39  android  male     bra   17
1     39  android  male     bra   17
2     49  android  male     bra   17
3     29  android  male     tur   17
4     49  android  male     tur   17
##################### Tail #####################
      PRICE   SOURCE     SEX COUNTRY  AGE
4995     29  android  female     bra   31
4996     29  android  female     bra   31
4997     29  android  female     bra   31
4998     39  android  female     bra   31
4999     29  android  female     bra   31
##################### NA #####################
PRICE      0
SOURCE     0
SEX        0
COUNTRY    0
AGE        0
dtype: int64
##################### Quantiles #####################
       0.00  0.05  0.50  0.95  0.99  1.00
PRICE   9.0  19.0  39.0  49.0  59.0  59.0
AGE    15.0  15.0  21.0  43.0  53.0  66.0

In [7]:
cat_cols = [col for col in df.columns if df[col].dtypes == "O"]

In [8]:
df[cat_cols].nunique()

SOURCE     2
SEX        2
COUNTRY    6
dtype: int64

In [9]:
df['SOURCE'].unique()

array(['android', 'ios'], dtype=object)

In [10]:
df['SOURCE'].value_counts()

android    2974
ios        2026
Name: SOURCE, dtype: int64

In [11]:
df['PRICE'].unique()

array([39, 49, 29, 19, 59,  9], dtype=int64)

In [12]:
df['PRICE'].value_counts()

29    1305
39    1260
49    1031
19     992
59     212
9      200
Name: PRICE, dtype: int64

In [13]:
df['COUNTRY'].unique()
df['COUNTRY'].value_counts()

usa    2065
bra    1496
deu     455
tur     451
fra     303
can     230
Name: COUNTRY, dtype: int64

In [14]:
df.groupby('COUNTRY')['PRICE'].sum()

COUNTRY
bra    51354
can     7730
deu    15485
fra    10177
tur    15689
usa    70225
Name: PRICE, dtype: int64

In [15]:
df.groupby('SOURCE')['PRICE'].count()

SOURCE
android    2974
ios        2026
Name: PRICE, dtype: int64

In [16]:
df.groupby('COUNTRY')['PRICE'].mean()

COUNTRY
bra    34.327540
can    33.608696
deu    34.032967
fra    33.587459
tur    34.787140
usa    34.007264
Name: PRICE, dtype: float64

In [17]:
df.groupby('SOURCE')['PRICE'].mean()

SOURCE
android    34.174849
ios        34.069102
Name: PRICE, dtype: float64

In [18]:
df.groupby(['COUNTRY', 'SOURCE'])['PRICE'].mean()

COUNTRY  SOURCE
bra      android    34.387029
         ios        34.222222
can      android    33.330709
         ios        33.951456
deu      android    33.869888
         ios        34.268817
fra      android    34.312500
         ios        32.776224
tur      android    36.229437
         ios        33.272727
usa      android    33.760357
         ios        34.371703
Name: PRICE, dtype: float64

In [19]:
df.groupby(['COUNTRY', 'SOURCE', 'SEX', 'AGE'])['PRICE'].mean()

COUNTRY  SOURCE   SEX     AGE
bra      android  female  15     38.714286
                          16     35.944444
                          17     35.666667
                          18     32.255814
                          19     35.206897
                                   ...
usa      ios      male    42     30.250000
                          50     39.000000
                          53     34.000000
                          55     29.000000
                          59     46.500000
Name: PRICE, Length: 348, dtype: float64

In [20]:
agg_df = pd.DataFrame(df.groupby(['COUNTRY', 'SOURCE', 'SEX', 'AGE'])['PRICE'].mean()).sort_values(by=['PRICE'],
                                                                                                   ascending=False)
agg_df

                            PRICE
COUNTRY SOURCE  SEX    AGE
bra     android male   46    59.0
usa     android male   36    59.0
fra     android female 24    59.0
usa     ios     male   32    54.0
deu     android female 36    49.0
...                           ...
usa     ios     female 38    19.0
                       30    19.0
can     android female 27    19.0
fra     android male   18    19.0
deu     android male   26     9.0

[348 rows x 1 columns]

In [21]:
agg_df.reset_index(inplace=True)
agg_df

    COUNTRY   SOURCE     SEX  AGE  PRICE
0       bra  android    male   46   59.0
1       usa  android    male   36   59.0
2       fra  android  female   24   59.0
3       usa      ios    male   32   54.0
4       deu  android  female   36   49.0
..      ...      ...     ...  ...    ...
343     usa      ios  female   38   19.0
344     usa      ios  female   30   19.0
345     can  android  female   27   19.0
346     fra  android    male   18   19.0
347     deu  android    male   26    9.0

[348 rows x 5 columns]

In [22]:
agg_df['AGE_CAT'] = pd.qcut(agg_df['AGE'], 5, labels=['0_18', '19_23', '24_30', '31_40', '41_70']).astype(str)
agg_df

    COUNTRY   SOURCE     SEX  AGE  PRICE AGE_CAT
0       bra  android    male   46   59.0   41_70
1       usa  android    male   36   59.0   31_40
2       fra  android  female   24   59.0   24_30
3       usa      ios    male   32   54.0   31_40
4       deu  android  female   36   49.0   31_40
..      ...      ...     ...  ...    ...     ...
343     usa      ios  female   38   19.0   41_70
344     usa      ios  female   30   19.0   31_40
345     can  android  female   27   19.0   24_30
346     fra  android    male   18   19.0    0_18
347     deu  android    male   26    9.0   24_30

[348 rows x 6 columns]

In [23]:
agg_df["customers_level_based"] = [df_val[0].upper() + '_' + df_val[1].upper() + '_' + df_val[2].upper() + '_' + df_val[5].upper() for df_val in
                                   agg_df.values]

In [24]:
agg_df.groupby(['customers_level_based'])['PRICE'].mean()
agg_df
new_agg_df = pd.DataFrame(agg_df[['customers_level_based','PRICE']])
new_agg_df

        customers_level_based  PRICE
0      BRA_ANDROID_MALE_41_70   59.0
1      USA_ANDROID_MALE_31_40   59.0
2    FRA_ANDROID_FEMALE_24_30   59.0
3          USA_IOS_MALE_31_40   54.0
4    DEU_ANDROID_FEMALE_31_40   49.0
..                        ...    ...
343      USA_IOS_FEMALE_41_70   19.0
344      USA_IOS_FEMALE_31_40   19.0
345  CAN_ANDROID_FEMALE_24_30   19.0
346     FRA_ANDROID_MALE_0_18   19.0
347    DEU_ANDROID_MALE_24_30    9.0

[348 rows x 2 columns]

In [25]:
new_agg_df['SEGMENT'] = pd.qcut(new_agg_df['PRICE'], 4, labels=['D','C','B','A'])
new_agg_df

        customers_level_based  PRICE SEGMENT
0      BRA_ANDROID_MALE_41_70   59.0       A
1      USA_ANDROID_MALE_31_40   59.0       A
2    FRA_ANDROID_FEMALE_24_30   59.0       A
3          USA_IOS_MALE_31_40   54.0       A
4    DEU_ANDROID_FEMALE_31_40   49.0       A
..                        ...    ...     ...
343      USA_IOS_FEMALE_41_70   19.0       D
344      USA_IOS_FEMALE_31_40   19.0       D
345  CAN_ANDROID_FEMALE_24_30   19.0       D
346     FRA_ANDROID_MALE_0_18   19.0       D
347    DEU_ANDROID_MALE_24_30    9.0       D

[348 rows x 3 columns]

In [26]:
new_user_tr = "TUR_ANDROID_FEMALE_31_40"
new_agg_df[new_agg_df["customers_level_based"] == new_user_tr].agg({"PRICE":"mean"})

PRICE    35.888889
dtype: float64

In [27]:
new_user_fr = "FRA_IOS_FEMALE_31_40"
new_agg_df[new_agg_df["customers_level_based"] == new_user_fr].agg({"PRICE":"mean"})

PRICE    32.636364
dtype: float64